
### Registeration no :    FA18-BCS-189-D.
### Name:        Ahmed Bilal Yousaf.

 # Python Tutorial - ML - (Assignment #1)

## Table of Contents
### 1. Introduction
### 2. Data Types 
    2.1. Variables 
    2.2. Numbers 
    2.3. Strings 
    2.4. Lists 
    2.5. Dictionaries 
    2.6. Tuples 
    2.7. Sets
### 3. Comparison Operators
### 4. If-Else Statements
### 5. For & While Loop
### 6. Functions
### 7. Lambda Functions 
    7.1 Map() 
    7.2 filter()
### 8. File I/O
### 9. Pandas Library Introduction
### 10. Series
    10.1 From ndarray 
    10.2 From dict 
    10.3 From Scalar value 
    10.4 Series is ndarray-like 
    10.5 Series is dict-like 
    10.6 Vectorized operations and label alignment with Series 
    10.7 Name Attribute
### 11. Data Frames 
    11.1 From Dict of series or dict 
    11.2 From Dict of ndarrays / lists 
    11.3 From a list of dicts 
    11.4 From a Dict of tuples
    11.5 Alternate Constructors
    11.6 Column Selection, Addition, Deletion
    11.7 Indexing / Selection
    11.8 Data alignment and arithmetic
    11.9 Transposing
### 12. Viewing Data

## 1. Introduction

Python has gathered alot of appreciation as a choice of language for Data Analytics.
Open Source and Free to install.
Awesome online community.
Very easy to learn.
It can become common language for data science.
It can also become a common language for production of web based analytics products.
As it is interpreted programming language so it is easier to implement.
Compilation is not required, execution process can be done directly.

Python is a widely used general-purpose, high level programming language. It was created by
Guido van Rossum in 1991 and further developed by the Python Software Foundation. It was
designed with an emphasis on code readability, and its syntax allows programmers to express
their concepts in fewer lines of code.
It is used for:
Web development (server-side)
Software development
Mathematics
System scripting ### Application of python There are so many applications of Python, here
are some of the them.
- Web development – Web framework like Django and Flask are based on Python. They help
you write server side code which helps you manage database, write backend programming
logic, mapping urls etc.
- Machine learning – There are many machine learning applications written in Python.
Machine learning is a way to write a logic so that a machine can learn and solve a particular
problem on its own. For example, products recommendation in websites like Amazon,
Flipkart, eBay etc. is a machine learning algorithm that recognises user’s interest. Face
recognition and Voice recognition in your phone is another example of machine learning.


## 2. Data Types

Following data types are used in Python to store and access the data. Those are explained below.

# 2.1 Variables
### Definition
In the context to programming, variables are the representative names which are assigned to 
the unknown data and it permits to use it independent of the data itself.
### Purpose
Purpose of the variable is to reduce the complexity in the program and it often use in the 
loop section where we need to iterate speciffic quantities. Variables are the most common prop
used in programming to store the data.
### Important
Without variables it is damn hard to keep track of your data inputs. For instance we need to 
store a string "My name is *** and i am learning python for machine learning" and then after 
wards we need to use it in various places such as while we are using loops  to iterate one 
object over another, so it is humanly difficult to type again and again this long value so 
instead we store it in a single letter such as "a" or we can give it any name depending on the
semantics of the data. This reduces complexity and work of the programmer.
### Applications
Variables are commonly used in the programming languages. To mention some of them, Java, Python,
Javascript e.t.c. There is no programming language which doest not require the use of variables. 
Even you can say that variables dont run the program instead they store values in them.
### Strengths
In python variables do not need explicit declaration to occupy memory spaces as the type of 
variable or the data type is decide aftter the the assignment of the value
### Weaknesses
There is'nt any weakness to a variable.
### suitable to use
As we have already discussed its importance, we can never neglect its use while being a programmer.
It is like he abc of the program.
### Some examples are given as follows:

In [1]:
num_1 = 3049586721.2348506                                                   #float type variable
num_2 = 506978243                                                            #integer type variable
description = "My name is *** and i am learning python for machine learning." #string type variable
#print all values
print ("Floating number:", num_1)
print ("Integer number:", num_2)
print ("String type:",description)

Floating number: 3049586721.2348504
Integer number: 506978243
String type: My name is *** and i am learning python for machine learning

# 2.2 Numbers

### Definition
In the context to programming, variables are the representative names which are assigned to the unknown data and it permits to use it independent of the data itself.
### Purpose
Some numbers store information in them an=nd some are used for calcultions.
### suitable to use
As we have already discussed its importance, we can never neglect its use while being a programmer. It is like he abc of the program

In [2]:
2 + 2

4

In [3]:
a = 2
b = 2.5
a + b

4.5

In [4]:
print(2.5+2.5)

5.0

# 2.3 Strings

### Definition
Strings are made up of different characters. Each character takes up 2 bytes which is equivalent to 16 bits. String data types are used to store words or combination of words having letters, numbers, special characters etc. We must write the data under double colon to access its value as a string data type 
### Purpose
When we need to store our name, we cannot use numbers as it obviously wont have any meaning in numbers, so i'll use strings which is made up of different characters. My name is "Bilal", in this letter 'B' is a single character so are the other ones but when we combine them they made a string. We can either write numbers in our sttring but it must be written under the string format "__".
### Importance
We can add functionalities in our code without strings, but we cannot understand them afterwards or our user wont be able to. To make an interface user friendly and more understandable, we use string data type. We can even write paragraphs in string.
### Applications
Strings are widely used in programming languages. In fact, strings are the most fundamental part of any programming language.
### Strengths
It makes our program more understandable by adding boiler plates and more user friendly.
### Weaknesses
There is no weakness to a string
### suitable to use
Suitable to use in any programming languages.
### Some examples are given as follows:

In [5]:
name  = "Ahmed Bilal Yousaf"
description = "is a Computer Science student who does theater as his side hobby."
print(name,description)

Ahmed Bilal Yousaf is a Computer Science student who does theater as his side hobby.

### Access values in String
Sometimes we need to access string from certain position so we do it by giving index of its value. Square brackets are used to access substrings in python. Space between words is equal to one index. And all the characters are considered string. When we are accesing the substring it acts like the index of array, which start froms zero and end at n-1. Here is the syntax [start Index: End Index] Start index is outbound which means it is not included in the substring wheras End index is inbound meaning it is included in the substring.
#### lets take an example:

In [6]:
# We have a string
name = "Ahmed Bilal Yousaf"
# Now we will access the substring onwards from the 5th position to the 11th of the overall string
print(name[5:11])

 Bilal

### Updatng a String
A string can be modified by + operator. here is the example:

In [7]:
# I want to print "Bilal Butt" instead of "Ahmed Bilal Yousaf"
name = "Ahmed Bilal Yousaf"
newName = name[6:12] + 'Butt'
newName

'Bilal Butt'

### Deleting a String
We can easily delete the whole string by del function and passing the reference variable to it in which string is stored.

In [8]:
name = "Bilal Butt"
print(name)`

SyntaxError: invalid syntax (<ipython-input-8-7fb4af2da641>, line 2)

In [ ]:
del name
name                     # as you can see in the output, it is` giving error as it cannot found variable named 'name'

## Special Operators
Some special operators are used in python to modify string in various ways. Such as '+', '*', 'in', '[:]', 'not in'. lets use them in examples:

### +  Operator
It is used to concatenate two or more strings.

In [ ]:
n1 = "Ahmed"
n2 = " Bilal"
n3 = " Yousaf"
n4 = " Butt"
new  = name + n2 + n3 + n4 
print(new)

### " * " operator
It is used for the repetition of the output.

In [ ]:
print(new * 3)

### [ ] operator
It is used to access values of string at certain index.

In [ ]:
new[20]

### [:] operator
It used to define range od string from starting to end index.

In [ ]:
new[6:18]

### "in" operator
It is a conditionary operator which return true or falsle on the fullfillment of the condition.

In [ ]:
print("Y" in new) 
print("Z" in new)

### "not in" operator
This returns true if not in string, otherwise false

In [ ]:
print("Bali" not in new)
print("Bila" not in new)

### Formatting operator
It is used to assign values within print statement.

In [ ]:
print("I am a theatre Artist at %s which is %d years old" %("Fiasco Theatre Company",3))

# 2.4 LISTS

General definition of a list could be that it the a number of connected items or names written or printed consecutively, typically one below the other. In python we uslist python. List indices starts from 0 just like arrays. It is declared inder square brackets[]. List indices starts from 0 similar to array.

### Importance
- Pyhton lists are widely used instead if arrays, the main difference between both is that array can store eleents of same data type only whereas python lists can store multiple type of elements under single list.

### Applications
Lists are widely used in python, from finding prime numbers to the automation in real industries. Its scope is not beyond python. List are usually used to store series of elements. While programming, it is the basic method to use a single variable for all the elements instead of indinidually using it to minimize the effort of a programmer and to make it time efficient.

### Strengths
- List are mutable (changeable)
- Lists are dynamics which means size is not fixed. Lists are represented using a square bracket[ ], separated by commas

### Weaknesses
It is suitable to use in almost all the cases but in some cases arrays are more usefull due to thier memory allocation.

### Suitable to Use
Lists are the core structure in python. Arrays are not widely used in python, however there are numpy library to use arrays in data science and other topics. Lists are usefull.

Some examples for lists are given below

In [9]:
nameANDage = ["Bilal Butt", 20]
nameANDage

['Bilal Butt', 20]

### Accessing valiues in Lists
- Note that the upper bound is inclusive in list slicing and the lower bound is exclusive.

In [10]:
vehicles = ["BMW","SWIFT","WAGON R", "SE-150", "Coure","Civic","Vitz","Alto","Corolla"]
print("Every value and index is included: ",     vehicles[0:])
print("from index 2 to 5, and 5 is not included:",vehicles[2:5])

Every value and index is included:  ['BMW', 'SWIFT', 'WAGON R', 'SE-150', 'Coure', 'Civic', 'Vitz', 'Alto', 'Corolla']
from index 2 to 5, and 5 is not included: ['WAGON R', 'SE-150', 'Coure']

### Upating Lists

In [11]:
marksheet = [990, 888, 240]
marksheet[2] = 770         # It will override last value
print("After overriding at 2nd index:  ",marksheet)
marksheet.append(933)
print("After using appending function: ",marksheet)

After overriding at 2nd index:   [990, 888, 770]
After using appending function:  [990, 888, 770, 933]

### Deleting from List

In [12]:
deletion = ["T-Shirts","Culprit", "Forgive", "Struggle", "Loneliness"]
# Now if i want to delete "culprit from the value and i also know at which index it is situated, i will use del function"
del deletion[1]
print("Culprit is deleted from the list: ",deletion)
# Now if i want to delete "Forgive" and i dont know its index than i can use remove() function
deletion.remove("Forgive")
print("Forgive is deleted from the list: ",deletion)

Culprit is deleted from the list:  ['T-Shirts', 'Forgive', 'Struggle', 'Loneliness']
Forgive is deleted from the list:  ['T-Shirts', 'Struggle', 'Loneliness']

# 2.5 Dictionary

Dictionaries are for storing values against keys. Dicturies are created within curly brackets{} and it is changeable. Dictionary does not allow duplicate values. We can also use list in dictionaries as a data type. Each value is separated by colon:. An empty dictionary can be written as {}. Each value is separated by comma,. 
### Importance
Dictionary are unordered and does not have unique value i.e index against every key. However, There cannot be two identical key. Python dictionary represents a data structure which is easy to use and helps in cleaning data more effectitvely. It is simple to use and much faster
### Application
Python dictionary makes it easier to read and change value and is especially use in predictive models. 
### Strengths
It is simple to use and is much more efficient than other data structures. It can store lists as its data. Keys in dictionaries are unique and cannot be identical but thier values can be same and identical.
### Weaknesses
Dictionary makes it difficult for programmer to write a number of elements with additional key values. Which i think is quite hard as semantics matter. And the more the values the more naming problems are going to occurr. Apart from it dictionaries are quite handy.
### Suitable to use
It is as suitable as any other data structure in python. It can store multiple list as a key value in it which makes it very manageable and handy. We can say it is a two in one feature.

Some examples are given below

In [13]:
nodes = {"dfs": ["A", "C", "B", "D"],
         "bfs": ["B","C","A","D"],
         }
nodes

{'dfs': ['A', 'C', 'B', 'D'], 'bfs': ['B', 'C', 'A', 'D']}

### Accessing values in Dictionary
- it is similar to accessing value by index in array but here instead of index we write its key

In [14]:
nodes = {"dfs": ["A", "C", "B", "D"],
         "bfs": ["B","C","A","D"],
         }
nodes["bfs"]

['B', 'C', 'A', 'D']

### Updating Dictionary
We can change existing value by accessing its key value and we can also add a new entry

In [15]:
nodes = {"dfs": ["A", "C", "B", "D"],
         "bfs": ["B","C","A","D"],
         "new": "bfs,dfs"
         }
print("Before changing 'new' value: ",nodes)
nodes["new"] = "onlydfs"
print("After changing 'new' value:  ",nodes)
nodes["bfs"][0] = 1
print("Changing.0th.index.of.list.at.key.value.'bfs':  ",nodes)
nodes["bfs"].append("last")
print("New.value.in.the.list.at.key.value.'bfs':",nodes)

Before changing 'new' value:  {'dfs': ['A', 'C', 'B', 'D'], 'bfs': ['B', 'C', 'A', 'D'], 'new': 'bfs,dfs'}
After changing 'new' value:   {'dfs': ['A', 'C', 'B', 'D'], 'bfs': ['B', 'C', 'A', 'D'], 'new': 'onlydfs'}
Changing.0th.index.of.list.at.key.value.'bfs':   {'dfs': ['A', 'C', 'B', 'D'], 'bfs': [1, 'C', 'A', 'D'], 'new': 'onlydfs'}
New.value.in.the.list.at.key.value.'bfs': {'dfs': ['A', 'C', 'B', 'D'], 'bfs': [1, 'C', 'A', 'D', 'last'], 'new': 'onlydfs'}

### Deleteion in Dictionary
We can delete individual element of dicitionary and complete content of dictionary.
del is used for individual element removal and clear() function is used to remove entire dictionary.

In [16]:
nodes = {"dfs": ["A", "C", "B", "D"],
         "bfs": ["B","C","A","D"],
        }
print("Original Dictionary: ", nodes)
del nodes["dfs"][2]
print("Deleted dfs value at 2nd index in the list", nodes)
del nodes["dfs"]
print("Deleted entire dfs value",nodes)
# Now removing dictionary
nodes.clear()
print("Dictionary is removed", nodes)

Original Dictionary:  {'dfs': ['A', 'C', 'B', 'D'], 'bfs': ['B', 'C', 'A', 'D']}
Deleted dfs value at 2nd index in the list {'dfs': ['A', 'C', 'D'], 'bfs': ['B', 'C', 'A', 'D']}
Deleted entire dfs value {'bfs': ['B', 'C', 'A', 'D']}
Dictionary is removed {}

# 2.6 Tuples

It is similar to lists with some minor changes in its structure. First off it is declared inside() small brackets and every value inside it is comma, separated. Another major difference is that it is not changeable. You have to write a comma at the end even if you are writing a single value. Just like lists and dictionary, it cannot also have multiple datatypes inside a single tuple.
### Importance
Tuples are widely used in python, from finding prime numbers to the automation in real industries. Its scope is not beyond python. List are usually used to store series of elements. While programming, it is the basic method to use a single variable for all the elements instead of indinidually using it to minimize the effort of a programmer and to make it time efficient.
### Application
It can have lots and lots of application. If we want to just show our data and not further want to update in we can use tuples. It can be used for comparisons between different objects and so on.
### Strengths
Immutabilty is its strength as it does not allow its sequence to be altered. Which is quite a plus point in regards to control over your data.
### Weaknesses
Immutability can also be its weakness as it does not allow you to update or modify existing tuple and in the case you have to make an entire new tuple to modify it.
### Suitable to use
It is suitable to use whereever immutability is required.

Some examples are given below

In [17]:
myTuple = ("Bilal","20 years","Bchelors in Computer Science",)
print(myTuple)

('Bilal', '20 years', 'Bchelors in Computer Science')

### Accessing value in Tuple

In [18]:
myTuple = ("Bilal","20 years","Bchelors in Computer Science",)
myTuple[1]
# or we can slice
myTuple[0:3]

('Bilal', '20 years', 'Bchelors in Computer Science')

### Updating Tuples
There is no way to update a tuple but part of it can be copied to form a new tuple.

In [19]:
myTuple = ("Bilal","20 years","Bchelors in Computer Science",)
tup1 = (1,2,3,4,5,6,)
tup2 = (6,5,4,3,2,1,)
tup = tup1[0:3] + tup2[0:3] + myTuple[0:1]
tup

(1, 2, 3, 6, 5, 4, 'Bilal')

### Deletion in Tuples
Removing individual element in Tuple is not possible because they can't be updated. del statment is used to remove entire Tuple.

In [20]:
myTuple = ("Bilal","20 years","Bchelors in Computer Science",)
tup1 = (1,2,3,4,5,6,)
tup2 = (6,5,4,3,2,1,)
tup = tup1[0:3] + tup2[0:3] + myTuple[0:1]
print(tup)
del myTuple
print("After Deleting: ", myTuple)

(1, 2, 3, 6, 5, 4, 'Bilal')

NameError: name 'myTuple' is not defined

# 2.7 Sets

## 2.6 Set
A set is a collection which is unordered and unindexed. In Python sets are written with curly brackets.

### Weakness
You cannot access items in a set by referring to an index, since sets are unordered the items has no index.
But you can loop through the set items using a for loop, or ask if a specified value is present in a set, by using the in keyword.

### Strengths
Once a set is created, you cannot change its items, but you can add new items.

### Add Items
To add one item to a set use the add() method.
To add more than one item to a set use the update() method

In [22]:
s1=('Bilal Butt','20','Lahore')

sets=set(s1)

print(sets)


print('Bilal Butt' in sets)

{'Bilal Butt', '20', 'Lahore'}
True

### Updating

In [23]:
s1=('Bilal Butt','20','Lahore')
sets = set(s1)
sets.update(["Ahmed","Yousaf"])
print(sets)

{'Ahmed', 'Bilal Butt', '20', 'Lahore', 'Yousaf'}

### Removing

In [24]:
s1=('Bilal Butt','20','Lahore')
sets = set(s1)
sets.remove("Bilal Butt")
print(sets)

{'20', 'Lahore'}

### Adding

In [25]:
s1=('Bilal Butt','20','Lahore')
sets = set(s1)
sets.add("Ahmed")
print(sets)

{'Ahmed', 'Bilal Butt', '20', 'Lahore'}

### Pop function

In [26]:
s1=('Bilal Butt','20','Lahore')
sets = set(s1)
print(sets)
new = sets.pop()
print(new)
print(sets)

{'Bilal Butt', '20', 'Lahore'}
Bilal Butt
{'20', 'Lahore'}

### Union

In [27]:
s1={'Bilal Butt','20','Lahore'}
s2={'Ahmed Bilal','20','Lahore'}
# set1 = set(s1)
# set2 = set(s2)
new = s1.union(s2)
print(new)

{'20', 'Lahore', 'Ahmed Bilal', 'Bilal Butt'}

# 3.0 Comparison Operators

These are used to compare values (string or numbers) and return true/false according to situation.
### Importance 
Without any doubt i can say that any programming language is incomplete withou comparison operators. 
### Purpose
They are used for reasoning and checking certain conditions. We almost use these in every line of programming code with few exceptions.
### Strengths
+ Equals: a == b
+ Not Equals: a != b
+ Less than: a < b
+ Less than or equal to: a <= b
+ Greater than: a > b
+ Greater than or equal to: a >= b

### Suitable to use
These conditions can be used in several ways, most commonly in "if statements" and loops.



Some of the examples are given below:

In [28]:
"Bilal" == "Ahmed"

False

In [29]:
x=67

if x%2==0:
    print('Even')
else:
    print('odd')

odd

In [30]:
"Bilal" != "Ahmed"

True

In [31]:
var = "Bilal"
x = "i"
if x in var:
    print('Present')
else:
    print('Absent')

Present

In [32]:
2 < 1

False

# 4.0 If-else Statements

If else statements are use to check certain conditions. They are use to make decisions between two or more choices. 
### Importance
We use if and else statement in every part of our program. They are the decision makers. There are some other statements also like switch break e.t.c but we use if-else in pyhton.
### Strengths
If-Else statments are used to execute a block of code depending on conditions. If block if condition is true otherwise else block. See following

In [33]:
a = 1
b = 2
if a>=b:
    print("a is greater than or equal to b")
else:
    print("a is not greater than or equal to b")

a is not greater than or equal to b

In [34]:
a = 1
b = 2
if a<=b:
    print("a is greater than or equal to b")
else:
    print("a is not greater than or equal to b")

a is greater than or equal to b

# 5.0 For and While loop

Python has two primitive loop commands:

- while loops
- for loops

## The while Loop
With the while loop we can execute a set of statements as long as a condition is true.
The while loop requires relevant variables to be ready, in this example we need to define an indexing variable, i, which we set to 1.

## For Loops
A for loop is used for iterating over a sequence (that is either a list, a tuple, a dictionary, a set, or a string).

This is less like the for keyword in other programming languages, and works more like an iterator method as found in other object-orientated programming languages.

With the for loop we can execute a set of statements, once for each item in a list, tuple, set etc

### The break Statement
With the break statement we can stop the loop even if the while condition is true.

### Importance
These loops helps in saving programmers time. They can be pretty handy when it comes to operating functions on arrays like data structures.
### Strengths
For instance, we have array of 500 objects and we want to print each of the obeject. We will have to print each object one by one. So in order to reduce our time we use loops. Which run one after another and iterates over the whole array and prints object through just 3 to 4 lines of code. That is why we use loops, they make our work efficient

In [35]:
cars  = ["Swift", "Grande", "Civic RS", "Wagon R"]

for x in cars:
    print(x)

Swift
Grande
Civic RS
Wagon R

In [36]:
cars = ["Swift","1348cc","2014"]
for i in cars:
    print(i)

Swift
1348cc
2014

In [37]:
integers = [1,2,3,23,42,24,546,757,886]
for i in integers:
    if i<800:
        print(i)

1
2
3
23
42
24
546
757

In [38]:
integer = 1
while integer<11:
    print(integer)
    integer+=1

1
2
3
4
5
6
7
8
9
10

In [39]:
i=1
while i<10:
    print(i)
    if i==2:
        break
    i+=1

1
2

# 6.0 Functions

A function is a block of code which only runs when it is called.
You can pass data, known as parameters, into a function.
A function can return data as a result.
####  Creating a Function
In Python a function is defined using the def keyword.
#### Calling a Function
To call a function, use the function name followed by parenthesis.
## Types of Functions
Basically, we can divide functions into the following two types:

+ Built-in functions - Functions that are built into Python.
+ User-defined functions - Functions defined by the users themselves.

## Purpose of using function
Python by using functions in our code:
1. Code re-usability:
Lets say we are writing an application in Python where we need to perform a specific task in several places of our code, assume that we need to write 10 lines of code to do that specific task. It would be better to write those 10 lines of code in a function and just call the function wherever needed, because writing those 10 lines every time you perform that task is tedious, it would make your code lengthy, less-readable and increase the chances of human errors.

2. Improves Readability:
By using functions for frequent tasks you make your code structured and readable. It would be easier for anyone to look at the code and be able to understand the flow and purpose of the code.

3. Avoid redundancy:
When you no longer repeat the same lines of code throughout the code and use functions in places of those, you actually avoiding the redundancy that you may have created by not using functions.

In [40]:
def func(str):
    print(str)
    return;

func("My name is BILAL")

My name is BILAL

In [41]:
def my_func():
    x = 10
    print("Value inside function:",x)

y = 50
my_func()
print("Value outside function:",y)

Value inside function: 10
Value outside function: 50

### Recurstion fuction:
A function is said to be a recursive if it calls itself. For example, lets say we have a function abc() and in the body of abc() there is a call to the abc().
#### Python example of Recursion
In this example we are defining a user-defined function factorial(). This function finds the factorial of a number by calling itself repeatedly until the base case is reached.

In [45]:
def factorial(i):
    if i==1:
        return 1
    else:
        return (i * factorial(i - 1))
i = int (input())
print("Factorial of",i, "=", factorial(i))

10
Factorial of 10 = 3628800

#### Advantages of recursion
Recursion makes our program:
1. Easier to write.
2. Readable – Code is easier to read and understand.
3. Reduce the lines of code – It takes less lines of code to solve a problem using recursion.

#### Disadvantages of recursion
1. Not all problems can be solved using recursion.
2. If you don’t define the base case then the code would run indefinitely.
3. Debugging is difficult in recursive functions as the function is calling itself in a loop and it is hard to understand which call is causing the issue.
4. Memory overhead – Call to the recursive function is not memory efficient.

# 7.0 Lambda Functions

A lambda function is a small anonymous function.
A lambda function can take any number of arguments, but can only have one expression.
#### Syntax
lambda arguments : expression
## Purpose of lamhba function
The power of lambda is better shown when you use them as an anonymous function inside another function.

Say you have a function definition that takes one argument, and that argument will be multiplied with an unknown number:

In [46]:
list_of_int = [1,23,34,6,58,45,33,38,9,9]
b = list(filter(lambda a: a%2 == 0,list_of_int))
b

[34, 6, 58, 38]

In [47]:
cars = ["Swift","Corolla"]
new = list(filter(lambda a:len(a)>5,cars))
new

['Corolla']

In [48]:
sqrt = lambda x: x**2
square_root = sqrt(5)
square_root

25

In [49]:
def func(n):
    return lambda a: a - n
result = func(2)
result(1)

-1

# 7.1 Map()

The map() function executes a specified function for each item in a iterable. The item is sent to the function as a parameter.

### Importance
The built-in function map() takes a function as a first argument and applies it to each of the elements of its second argument, an iterable. Examples of iterables are strings, lists, and tuples.

### Purpose
Purpose of map function is to take a list and apply some operations on it and store the new outcome in a new list. They are very widely used when it comes to performing operations on lists and other list like data structure.

### Stregths

map() returns an iterator corresponding to the transformed collection. 

### Syntax
map(function, iterables)
As an example.

Some examples are given below

In [50]:
vehicles = ["Suzuki 150","Swift", "WaGon R"]
newVehicles = list(map(lambda a: a.upper(), vehicles ))
print("Converted to upper case:", newVehicles)

Converted to upper case: ['SUZUKI 150', 'SWIFT', 'WAGON R']

In [51]:
integers = [2,4,6,7,8,10,12,14,16,18,20]
sqrt = set(map(lambda x: x**2, integers)) # in set
print("Square roots:",list(sqrt))   # back in list, for practise

Square roots: [64, 256, 4, 36, 100, 196, 324, 16, 49, 144, 400]

In [52]:
# map() can listify the list of strings individually 
into_List = list(map(list,["Swift","GS","Honda"]))
into_List

[['S', 'w', 'i', 'f', 't'], ['G', 'S'], ['H', 'o', 'n', 'd', 'a']]

#  7.2 Filter()

The filter() method filters the given sequence with the help of a function that tests each element in the sequence to be true or not.

### Importance
Filter are used to make a copy of object which only contains our desired results. e.g we go to Pakwheels website and sort the car by the company, or the its mileage, or its model year, these all are the wonders of filter function that they return you your desired results.

### Purpose
purpose of filter function is very clear as they help us in filtering the lists and objects according to our desired parameters and conditions.


### Parameters:
function: function that tests if each element of a 
sequence true or not.
sequence: sequence which needs to be filtered, it can 
be sets, lists, tuples, or containers of any iterators.

#### Syntax:
filter(function, sequence)

### Returns:
returns an iterator that is already filtered

In [53]:
num = [2,4,6,8]
newnew = list(filter(lambda x: x%4 == 0 and x%8 != 0, num))
print("After filtering the numbers list:",newnew)

After filtering the numbers list: [4]

In [54]:
cars = ["Wagon R","Grande","Corolla"]
new = list(filter(lambda a:len(a)>5,cars))
new

['Wagon R', 'Grande', 'Corolla']

# 8.0 File I/O

### Syntax Description
+ 'r'	Open a file for reading. (default)
+ 'w'	Open a file for writing. Creates a new file if it does not exist or truncates the file if it exists.
+ 'x'	Open a file for exclusive creation. If the file already exists, the operation fails.
+ 'a'	Open for appending at the end of the file without truncating it. Creates a new file if it does not exist.
+ 't'	Open in text mode. (default)
+ 'b'	Open in binary mode.
+ '+'	Open a file for updating (reading and writing)

### Importance
In AI and data science we work on data. So, in order to get data we need these operations to read , write, append or modify the file containing data.

In [55]:
f = open("sample.txt","w")
f.write("Hey! it is a sample text for file handling in python ")
f.close()
f = open("sample.txt","r")
print (f.read(26))

Hey! it is a sample text f

In [56]:
f = open("sample.txt","a")
f.write (" continuation of previous")
f = open("sample.txt","r")
print (f.read())

Hey! it is a sample text for file handling in python  continuation of previous

### File Positioning

In [57]:
f = open("sample.txt","a")
f.write (" continuation of previous")

position = f.tell();
print ("Current file position : ", position)
f.close()

f = open("sample.txt", "r")
print(f.read())

Current file position :  103
Hey! it is a sample text for file handling in python  continuation of previous continuation of previous

## Reading Input From Keybord

- For reading input from keyboard, raw_input() method is used.
- It reads only one line from standard input and returns it as a string. 

### Importance
There are many programs which takes inputs from user. For instance take example from a login form. It demands our username, email, and password which we have to enter.

### Purpose
So, how do we enter it. That is where user input comes.

### Syntax 
There are is a syntax for user input which is raw.input()

In [58]:
user_input = input("What do you want to print? ")
print(user_input)

What do you want to print? My name is Bilal Butt.
My name is Bilal Butt.

In [59]:
def func(i,j):
    return i + j
i = int (input("First Number? "))
j = int(input("Second Number? "))
print("sum of",i," and ",j, "=", func(i,j))

First Number? 20
Second Number? 80
sum of 20  and  80 = 100

# 9.0 Pandas

- Pandas is an open source library built on top of Numpy
- It allows for fast analysis and data cleaning and preperation
- It excels in performance and productivity
- It also has built in visualization features
- It can work with data from a wide variety of sources

### Importance
With pandas, you become familiar with your data by refining it, modifying it, and updating it.

For example, it says you want to view the database stored in CSV on your computer. The Pandas will extract data from that CSV into DataFrame - a table, basically - and allow you to do things like:

Count the numbers and answer questions about the data, like
- What is the average, average, maximum, or minute in each column?
- Is column A compatible with column B?
- What does the distribution of data in column C look like?
Clean data by doing things like subtracting lost values ​​and sorting rows or columns for certain conditions
Visualize data with help from Matplotlib. Plot bars, lines, histograms, bubbles, and more.
Save cleaned, converted data to CSV, another file or database

# 10.0 Series

- Series is very similar to NumPy array.
- Series is 1-D array labeled array capable of holding any type of data.
- The diffence between the NumPy array from a series is that a series can have axis labels. This means it can be indexed by a label, instead of just a number location.
- The axis labels are collectively referred to as the index.
- Following function is used to create a series:
    S = pd.Series (data,index = index)
- In the function, data can be many different things.

In [2]:
# importing pandas and numpy libraries as we will be needing
# these throughtout the remaining tutorial.

import pandas as pd
import numpy as np

In [68]:
series = pd.Series(["Blue","Black","Bold","Bag","Busted"])
series

0      Blue
1     Black
2      Bold
3       Bag
4    Busted
dtype: object

###### Lets make some other series for better understanding.

In [69]:
cars  = ["Swift", "Grande", "Civic RS", "Wagon R"]
ser = pd.Series (cars)

###### Now if we want indexes of our selection, we will write following lines of code.
###### First we will make a list of indexes which we want and then we will pass it to the Series

In [70]:
ser = pd.Series (cars)
print(ser)

0       Swift
1      Grande
2    Civic RS
3     Wagon R
dtype: object

## From ndarray

###### If data is an ndarray, index must be the same length as data.
###### If no index is passed, one will be created having values [0, ..., len(data) - 1].

In [71]:
ind = ["a","b","c","d"]
ser = pd.Series (cars,index = ind )
print("After indexing: ")
print(ser)

After indexing:
a       Swift
b      Grande
c    Civic RS
d     Wagon R
dtype: object

###### Or we can pass a function in the value which will automatically generate random values.
###### But the important thing to consider is that the index value count and the value count must be equal.

In [72]:
ser = pd.Series (np.random.randn(4),ind)
ser

a   -1.307907
b   -1.958867
c    2.015849
d    1.201347
dtype: float64

###### We can also create index while creating series, like done in the following example

In [73]:
ser = pd.Series (np.random.randn(4),index = ["a","b","c","d"])
ser

a    0.363897
b   -0.088447
c    0.809803
d    0.221665
dtype: float64

###### Series.index prints the list of indexes along with its data type

In [74]:
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

###### lets take an other example in which we will have a car model as index value and the value will be cars name

In [75]:
node = pd.Series (cars, index = [2010,2012,2014,2020])
node

2010       Swift
2012      Grande
2014    Civic RS
2020     Wagon R
dtype: object

In [76]:
# we can check the size of array by following function
node.size

4

In [77]:
# and there is also a function to check datatype
print(node.dtype)

object

# From Dict

- If data is a dict, if index is passed the values in data corresponding to the labels, the index will be pulled out.
- If index is not passed then it will be constructed from the sorted keys of the dict, if possible.

In [78]:
dict = {"Car":"Swift","Bike":"GS-150se","Truck":"Hilux-Revo"}
node = pd.Series(dict)
node

Car           Swift
Bike       GS-150se
Truck    Hilux-Revo
dtype: object

###### Note that we cannot change the existing index of the dictionary as you can see in the following code that c index contains no value because there is no value against it in the dictionary.

In [79]:
dict = {"Car":"Swift","Bike":"GS-150se","Truck":"Hilux-Revo"}
node = pd.Series(dict,index = ["Bike","Car","c"])
node

Bike    GS-150se
Car        Swift
c            NaN
dtype: object

In [80]:
node.index

Index(['Bike', 'Car', 'c'], dtype='object')

In [81]:
dict = {"":"Swift","":"GS-150se","":"Hilux-Revo"}
node = pd.Series(dict)
node

    Hilux-Revo
dtype: object

In [82]:
node.index

Index([''], dtype='object')

# 10.3 From a Scalar Value

- if the data is scalar then it should be provided the index and it runs to match length of index.
- Examples are :

In [83]:
ind = ["blue","green","black","orange","red","yellow"]
node = pd.Series(6,ind)
node

blue      6
green     6
black     6
orange    6
red       6
yellow    6
dtype: int64

In [84]:
#using a fucntion to give values to index
ind = ["blue","green","black","orange","red","yellow"]
node = pd.Series(len(node.index),ind)
node

blue      6
green     6
black     6
orange    6
red       6
yellow    6
dtype: int64

In [85]:
node = pd.Series(("b","g","b","o","r","y"),
                 index = ["blue","green","black","orange","red","yellow"])
node

blue      b
green     g
black     b
orange    o
red       r
yellow    y
dtype: object

# 10.4 Series is ndarray-like

1. It acts similar to a ndarray.
2. It is a valid argument to most NumPy functions. 
3. However, things like slicing also slice the index.

In [86]:
#Accessing a single value
node[3]

'o'

In [93]:
#access single value
node[1]

'g'

###### Slicing

In [94]:
node[:3]

blue     b
green    g
black    b
dtype: object

In [109]:
node = pd.Series ([1,2,3,4,5])
node[node.mean()]

4

###### Using truncate function from numpy library

In [98]:
np.trunc(node)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

###### Using square function from numpy library

In [100]:
np.square(node)

0     1
1     4
2     9
3    16
4    25
dtype: int64

###### Accessing values at random indexes

In [101]:
node[[2,1,3,0]]

2    3
1    2
3    4
0    1
dtype: int64

###### Returning True or false by checking value i node

In [102]:
2 in node

True

###### get fucntions returns the value of that label if present, if label is not present it returns null or nothing

In [110]:
node = pd.Series ([1,2,3,4,5], index = ["a","b","c","d","e"])
node.get("b")

2

In [112]:
node.get("f")

# 10.6 Vectorized operations and label alignment with Series

1. When doing data analysis, as with raw NumPy arrays looping through Series value-by-value is usually not necessary.
2. Series can also be passed into most NumPy methods expecting an ndarray.

We can operate on series just like we do on any integers in maths. We can multiply it, we can divide it, we can assign objects to the series if it is a string. We can rename a string and we can perform other numerous operations on it.

#### Multiplying series

In [114]:
node * node * node **2

a      1
b     16
c     81
d    256
e    625
dtype: int64

#### Dividing series and then multiplying it

In [118]:
node / 2 * node

a     0.5
b     2.0
c     4.5
d     8.0
e    12.5
dtype: float64

#### We can provide objects to the series

In [120]:
name = "Bilal"
node = pd.Series([1,2,3,4], name = name)
node

0    1
1    2
2    3
3    4
Name: Bilal, dtype: int64

In [121]:
node.name

'Bilal'

#### We can give one series reference name to the other one and can also rename it.

In [122]:
name = "Bilal Butt"
node = node.rename(name)
node.name

'Bilal Butt'

# 11. Data Frames

A DataFrame is a 2 dimensional object that can have columns with potential different types. Different kind of inputs include dictionaries, lists, series, and even another DataFrame.

It is the most commonly used pandas object
- Data frames are inspired of R programming language and are workhorse of pandas.
- Data frames accepts following type of inputs.
- A dict of series or dict.
- Structured or record ndarray.
- A Series.
- Another DataFrame.
- alongwith data, column and rows arguements are also optionally passed and passing them guarantees the index of data frames.
- Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.
- If axis labels are not passed, they will be constructed from the input data based on common sense rules.

In [123]:
import pandas as pd

In [146]:
node = [["bilal","murtaza","abdul aziz","saaim"],
        ["ford","bmw","audi","mercedes"],
        [1,2,3,4],
        ["BCS","BCS","BCS","BCS"]]

df = pd.DataFrame(node, columns = [1,2,3,4])    
df

       1        2           3         4
0  bilal  murtaza  abdul aziz     saaim
1   ford      bmw        audi  mercedes
2      1        2           3         4
3    BCS      BCS         BCS       BCS

- #### Changing indexes

In [145]:
df.index = ["Friends","Cars","rand","Degree"] 
df

             1        2           3         4
Friends  bilal  murtaza  abdul aziz     saaim
Cars      ford      bmw        audi  mercedes
rand         1        2           3         4
Degree     BCS      BCS         BCS       BCS

# 11.1 Creating DataFrame from Series or Dicts

To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length

- The result index will be the union of the indexes of the various Series.
- Nested dicts(if any) are first converted to Series.
- The columns will be the sorted list of dict keys,If no columns are passed.

In [199]:
dict = { "First": pd.Series(("yo","my","friend","what's","..","up"),
                       index = ["F","R","E","I","N","D"]),
         "Second": pd.Series(np.random.randn(6)),
       }
df = pd.DataFrame (dict)
df

    First    Second
0     NaN  0.102338
1     NaN -0.375488
2     NaN -1.149499
3     NaN  0.532773
4     NaN  0.304549
5     NaN  0.424916
D      up       NaN
E  friend       NaN
F      yo       NaN
I  what's       NaN
N      ..       NaN
R      my       NaN

- #### If we dont initialize either of thier indexes then the data frame wil be like following.

In [200]:
dict = { "First": pd.Series(("yo","my","friend","what's","..","up")),
         "Second": pd.Series(np.random.randn(6)),
       }
df = pd.DataFrame (dict)
df

    First    Second
0      yo  0.839456
1      my -0.657347
2  friend -0.688538
3  what's -0.126260
4      .. -0.753315
5      up  1.855982

In [201]:
dict = { "First": pd.Series(("yo","my","friend","what's","..","up")),
         "Second": pd.Series(np.random.randn(8)),
       }
df = pd.DataFrame (dict)
df

    First    Second
0      yo -0.063283
1      my -0.282680
2  friend  0.983543
3  what's  0.839583
4      ..  0.637034
5      up -1.989318
6     NaN -0.869327
7     NaN -1.293757

- #### When both are same indexed

In [204]:
dict = { "First": pd.Series(("yo","my","friend","what's","..","up"),
                       index = ["F","R","E","I","N","D"]),
         "Second": pd.Series(np.random.randn(6),
                             index = ["F","R","E","I","N","D"])
       }
df = pd.DataFrame (dict)
df

    First    Second
F      yo  0.279650
R      my  1.162913
E  friend  0.707504
I  what's  1.535876
N      .. -0.812017
D      up  2.882176

- #### There is a function called loc which is use to access rows in Data Frame, but here we will use index to extract row

In [207]:
dict = { "First": pd.Series(("yo","my","friend","what's","..","up"),
                       index = ["F","R","E","I","N","D"]),
         "Second": pd.Series(np.random.randn(6),
                             index = ["F","R","E","I","N","D"])
       }
df = pd.DataFrame (dict, index = ["F","R","E","I"])
df

    First    Second
F      yo -1.178670
R      my  1.106896
E  friend -0.911810
I  what's -0.678876

- ##### New column names having no value

In [208]:
pd.DataFrame(dict,index=[1,4],columns=["Bilal","Age"])

  Bilal  Age
1   NaN  NaN
4   NaN  NaN

In [210]:
pd.DataFrame(dict,index=["C","A","T"],columns=["D","O","G"])

     D    O    G
C  NaN  NaN  NaN
A  NaN  NaN  NaN
T  NaN  NaN  NaN

In [214]:
df.columns

Index(['First', 'Second'], dtype='object')

In [215]:
df.index

Index(['F', 'R', 'E', 'I'], dtype='object')

- ##### df.shape returns the total number of rows and columns

In [216]:
df.shape

(4, 2)

# 11.2 Creating Dataframe from list of dicts

Pandas DataFrame can be created by passing lists of dictionaries as a input data. By default dictionary keys taken as columns
- length should be same of ndarrays.
- If an index is passed, it must clearly also be the same length as the arrays.
- Result will be of range(n), where n is the array length,If no index is passed.

In [220]:
listOfDicts = [{'A': 1, 'B': 2, 'C':3}, 
        {'A':10, 'B': 20, 'C': 30}, 
        {'A':100, 'B': 200, 'C': 300},
        {'A':1000, 'B': 2000, 'C': 3000}] 
df = pd.DataFrame(listOfDicts) 
df

      A     B     C
0     1     2     3
1    10    20    30
2   100   200   300
3  1000  2000  3000

- ###### We can assign Nan to the value we don't want to assign by np.nan function

In [224]:
listOfDicts = [{'A': np.nan, 'B': 2, 'C':3}, 
        {'A':10, 'B': np.nan, 'C': 30}, 
        {'A':100, 'B': 200, 'C': np.nan},
        {'A':1000, 'B': 2000, 'C': 3000}] 
df = pd.DataFrame(listOfDicts) 
df

        A       B       C
0     NaN     2.0     3.0
1    10.0     NaN    30.0
2   100.0   200.0     NaN
3  1000.0  2000.0  3000.0

- ###### Similarly, another column will be created by the name nan if we assign nan value inplace of the key value.

In [226]:
listOfDicts = [{'A': np.nan, 'B': 2, np.nan:3}, 
        {'A':10, 'B': np.nan, 'C': 30}, 
        {'A':100, 'B': 200, np.nan: np.nan},
        {'A':1000, np.nan: 2000, 'C': 3000}] 
df = pd.DataFrame(listOfDicts) 
df

        A      B     NaN       C
0     NaN    2.0     3.0     NaN
1    10.0    NaN     NaN    30.0
2   100.0  200.0     NaN     NaN
3  1000.0    NaN  2000.0  3000.0

- #### df.fillna() is the function used for replacing null values with another value. Its syntax is;
- #### DataFrame.fillna ( value = None, method = None, axis = None, inplace = False, limit = None, downcast = None ). There are certains method which are used for auto fill, such as bfill, ffill which mean backward fill and forward fill.

In [232]:
df.fillna("****", inplace = True)
print("After replacing nan values with estericks:")
df

After replacing nan values with estericks:

      A     B   NaN     C
0  ****     2     3  ****
1    10  ****  ****    30
2   100   200  ****  ****
3  1000  ****  2000  3000

- #### Columns are inserted at the index you chose, in the following example i will create a "new" column at the last index.

In [240]:
df.insert(4,"New", ["B","I","L","A"])
df

      A     B   NaN     C New
0  ****     2     3  ****   B
1    10  ****  ****    30   I
2   100   200  ****  ****   L
3  1000  ****  2000  3000   A

- #### If we give iindex then it would be same length as arrays

In [243]:
pd.DataFrame(listOfDicts, index=['B', 'O', 'B', 'Y'])

        A      B     NaN       C
B     NaN    2.0     3.0     NaN
O    10.0    NaN     NaN    30.0
B   100.0  200.0     NaN     NaN
Y  1000.0    NaN  2000.0  3000.0

# 11.3 Creating DataFrame from Dicts of series.

In [247]:
data = {'TOM' : pd.Series(["B","O","B","Y"], index =["D","E","O","L"]), 
       'Cruising' : pd.Series(["B","O","B","Y"], index =["D","E","O","L"])} 

df = pd.DataFrame(data) 
df

  TOM Cruising
D   B        B
E   O        O
O   B        B
L   Y        Y

In [249]:
student = [["Bilal","Lahore"] ,
           ["Murtaza", "Bahawalpur"] ,
           ["Ali", "Lahore"],
           ["Bilal", "Lahore"],
           ["Saaim", "Lahore"]]
pd.DataFrame(student)

         0           1
0    Bilal      Lahore
1  Murtaza  Bahawalpur
2      Ali      Lahore
3    Bilal      Lahore
4    Saaim      Lahore

# 11.2 From dict of ndarrays / list

In [260]:
data = {'TOM' : ["B","O","B","Y"],  
       'Cruising' : ["B","O","B","Y"]} 

df = pd.DataFrame(data) 
df

  TOM Cruising
0   B        B
1   O        O
2   B        B
3   Y        Y

In [261]:
data = {1 : ["B","O","B","Y"],  
       2 : ["B","O","B","Y"]} 

df = pd.DataFrame(data) 
df

   1  2
0  B  B
1  O  O
2  B  B
3  Y  Y

- #### Now we will assign different values to the rows index

In [250]:
pd.DataFrame(student,index=["A","B","C","D","E"])

         0           1
A    Bilal      Lahore
B  Murtaza  Bahawalpur
C      Ali      Lahore
D    Bilal      Lahore
E    Saaim      Lahore

- #### Now we will assign different values to the Columns index

In [251]:
pd.DataFrame(student, columns=["Name","City"])

      Name        City
0    Bilal      Lahore
1  Murtaza  Bahawalpur
2      Ali      Lahore
3    Bilal      Lahore
4    Saaim      Lahore

# 11.3 From list of dicts

- #### You can see in the following example that how data frame creates index values from the key value within the dictionary.

In [255]:
df1 = [{'A': 1, 'B': 2}, {'A': 5, 'B': 10, 'C': 20}]
df = pd.DataFrame(df1)
df

   A   B     C
0  1   2   NaN
1  5  10  20.0

In [257]:
df1 = [{'A': 1, 'B': 2}, {'A': 5, 'B': 10, 'C': 20},{'A': 5, 'B': 10, 'C': 20}]
df = pd.DataFrame(df1)
df

   A   B     C
0  1   2   NaN
1  5  10  20.0
2  5  10  20.0

- #### There is a dropna() function in pandas which delete the entire row from a data frame if it found any null value in any column against that row.

In [258]:
df.dropna()

   A   B     C
1  5  10  20.0
2  5  10  20.0

# 11.4 From dict of tuples

In [264]:
data = {"Tuple 1" : ("B","O","B","Y"),  
       "Tuple 2" : (1,3,6,8)} 

df = pd.DataFrame(data) 
df

  Tuple 1  Tuple 2
0       B        1
1       O        3
2       B        6
3       Y        8

In [269]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

- #### There could be a data frame from the list of tuple as well just like it can from the dict of tuples.

In [268]:
node = [
('Ball', "Name1", [18, 17], ),
('Bat', "Name2", ['A', 'C', 'B'],),
('Cricket', "Name3", [6, 8, 7, 5],),
]
pd.DataFrame(node)

         0      1             2
0     Ball  Name1      [18, 17]
1      Bat  Name2     [A, C, B]
2  Cricket  Name3  [6, 8, 7, 5]

# 11.5 Alternate Constructors

- DataFrame.from_dict takes a dict of dicts or array-like sequences and returns a DataFrame.
- It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order to use the dict keys as row labels.

### DataFrame.from_records :
- DataFrame.from_records takes a list of tuples or an ndarray with structured dtype.
- Works analogously to the normal DataFrame constructor, except that index maybe be a specific field of the structured dtype to use as the index. For example:

### DataFrame.from_items
- DataFrame.from_items works analogously to the form of the dict constructor that takes a sequence of (key, value) pairs, where the keys are column (or row, in the case of orient='index') names, and the value are the column values (or row values). 
- This can be useful for constructing a DataFrame with the columns in a particular order without having to pass an explicit list of columns

In [270]:
node = [
('Ball', "Name1", [18, 17], ),
('Bat', "Name2", ['A', 'C', 'B'],),
('Cricket', "Name3", [6, 8, 7, 5],),
]
pd.DataFrame.from_dict(node)

         0      1             2
0     Ball  Name1      [18, 17]
1      Bat  Name2     [A, C, B]
2  Cricket  Name3  [6, 8, 7, 5]

#### Data can be provided as a structured ndarray:

In [276]:
data = np.array([(3, 'a'), (2, 'b'), (1, 'c'), (0, 'd')],
                dtype=[('col_1', 'i4'), ('col_2', 'U1')])
pd.DataFrame.from_records(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

#### Data can be provided as a list of dicts:

In [274]:
data = [{'col_1': 3, 'col_2': 'a'},
        {'col_1': 2, 'col_2': 'b'},
        {'col_1': 1, 'col_2': 'c'},
        {'col_1': 0, 'col_2': 'd'}]
pd.DataFrame.from_records(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

#### Data can be provided as a list of tuples with corresponding columns:

In [278]:
data = [(3, 'a'), (2, 'b'), (1, 'c'), (0, 'd')]
pd.DataFrame.from_records(data, columns = ['col_1', 'col_2'])

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [282]:
#used to give sequence in wwhich order you want to show
data = [(3, 'a'), (2, 'b'), (1, 'c'), (0, 'd')]
pd.DataFrame.from_records(data, index = ['A', 'B','C','D'])

   0  1
A  3  a
B  2  b
C  1  c
D  0  d

# 11.6 Column Selection, Addition, Deletion

- DataFrames could be treated semantically as dict because same operations like getting ,setting or deleting could be performed with same operations as dict.

In [296]:
# Display a single column
dict = { "First": pd.Series(("yo","my","friend","what's","..","up"),
                       index = ["F","R","E","I","N","D"]),
         "Second": pd.Series(np.random.randn(6),
                             index = ["F","R","E","I","N","D"])
       }
df = pd.DataFrame (dict, index = ["F","R","E","I"])
print(df)
print(".")
print(".")
print("Now printing only first column")
print(".")
print(".")
df["First"]

    First    Second
F      yo  0.788951
R      my -1.613848
E  friend -0.200222
I  what's  0.368161
.
.
Now printing only first column
.
.

F        yo
R        my
E    friend
I    what's
Name: First, dtype: object

In [318]:
data = [(3, 'a'), (2, 'b'), (1, 'c'), (0, 'd')]
df=pd.DataFrame.from_records(data, columns = ['col_1', 'col_2'])
print("Now applying arithematic operation on a column and storing it in a new column:")
df["new_col"] = df.col_1 * 2
df

Now applying arithematic operation on a column and storing it in a new column:

   col_1 col_2  new_col
0      3     a        6
1      2     b        4
2      1     c        2
3      0     d        0

In [305]:
df["nc"] = df ["new_col"] <= df["col_1"]
df

   col_1 col_2  new_col     nc
0      3     a        6  False
1      2     b        4  False
2      1     c        2  False
3      0     d        0   True

- #### The following function has three arguments. 
- #### First argument: index where new coloumn will be inserted. 
- #### Second argument: label or title of a new coloumn
- #### Third argument: it will create a coloumn at specified position

In [308]:
df.insert(4,'nnc',df["col_2"])
df

   col_1 col_2  new_col     nc nnc
0      3     a        6  False   a
1      2     b        4  False   b
2      1     c        2  False   c
3      0     d        0   True   d

#### delete function will delete the specified column

In [311]:
del df["nnc"]
df

   col_1 col_2  new_col     nc
0      3     a        6  False
1      2     b        4  False
2      1     c        2  False
3      0     d        0   True

#### Pop function will get and remove the specified coulmn and then store it in a new dataframe

In [322]:
df.pop("nc")
df

   col_1 col_2  new_col
0      3     a        6
1      2     b        4
2      1     c        2
3      0     d        0

In [327]:
#new column is created with values of column 2
df['new'] = 2
df

   col_1 col_2  new_col  new  copy
0      3     a        6    2   2.0
1      2     b        4    2   2.0
2      1     c        2    2   2.0
3      0     d        0    2   NaN

In [325]:
#this creates new coloumn and copies values of the other column
df['copy']=df['new'][:3]
df

   col_1 col_2  new_col  new  copy
0      3     a        6    2   2.0
1      2     b        4    2   2.0
2      1     c        2    2   2.0
3      0     d        0    2   NaN

   col_1 col_2  new_col  new  copy
0      3     a        6    2   2.0
1      2     b        4    2   2.0
2      1     c        2    2   2.0
3      0     d        0    2   NaN

# 11.7 Indexing / Selection

- #### Row  selection,  for  example,  returns  a  Series  whose  index  is  the  columns  of  the  DataFrame.  There  is  a special  function  use  to  access  and  operate  on  values  of  row  in  a  dataframe  and  that  is  known  as  loc function.  It  is  a  most  popular  function  among  programmers  community  in  who  works  in  data  science  and  in python.
- #### Identifying  pandas  means  simply  selecting  rows  and  columns  of  data  from  DataFrame.  Identifying  directions  can   mean  selecting  all  rows  and  other  columns,  some  rows  and  all  columns,  or  some  rows  and  columns.  The index  can  also  be  known  as  the  Subset  Selection

In [328]:
df.loc[2]

col_1      1
col_2      c
new_col    2
new        2
copy       2
Name: 2, dtype: object

In [329]:
df.loc[3]

col_1        0
col_2        d
new_col      0
new          2
copy       NaN
Name: 3, dtype: object

In [330]:
df.loc[2]

col_1      1
col_2      c
new_col    2
new        2
copy       2
Name: 2, dtype: object

- ### This returns complete row with first 2 columns.

In [333]:
df.iloc[:,:2]

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

# 11.8 Data alignment and arithmetic

- Data alignment between DataFrame objects automatically align on both the columns and the index (row labels).
- Again, the resulting object will have the union of the column and row labels.
- For binary operations on two Series or DataFrame objects, Pandas will align indices in the process of performing the operation. This is very convenient when working with incomplete data, as we'll see in some of the examples that follow.

One of the essential pieces of NumPy is the ability to perform quick element-wise operations, both with basic arithmetic (addition, subtraction, multiplication, etc.) and with more sophisticated operations (trigonometric functions, exponential and logarithmic functions, etc.)

In [370]:
df = pd.DataFrame(np.random.randn(5, 6), columns=['c1', 'c2', 'c3', 'c4','c5','c6'])
df1 = pd.DataFrame(np.random.randn(12, 4), columns=['c1', 'c2', 'c3','c4'])

In [371]:
df * df1

          c1        c2        c3        c4  c5  c6
0   0.169246 -0.071107  1.565278  0.024164 NaN NaN
1  -1.208061 -0.806538 -0.112920 -1.197678 NaN NaN
2   0.195210 -0.566972 -0.230765 -0.146356 NaN NaN
3  -1.051595 -0.529137 -0.776000  0.055117 NaN NaN
4  -2.900303  0.360172 -0.393078 -1.297514 NaN NaN
5        NaN       NaN       NaN       NaN NaN NaN
6        NaN       NaN       NaN       NaN NaN NaN
7        NaN       NaN       NaN       NaN NaN NaN
8        NaN       NaN       NaN       NaN NaN NaN
9        NaN       NaN       NaN       NaN NaN NaN
10       NaN       NaN       NaN       NaN NaN NaN
11       NaN       NaN       NaN       NaN NaN NaN

In [372]:
df1 + df

          c1        c2        c3        c4  c5  c6
0  -0.876353  0.969402 -2.598855  0.310918 NaN NaN
1  -0.296024 -0.460614  1.341614  0.878094 NaN NaN
2   0.954213  2.318599 -0.398201  0.526499 NaN NaN
3   1.445342 -0.933724 -0.906627 -1.181675 NaN NaN
4  -1.343302  1.427014  0.200408 -0.111997 NaN NaN
5        NaN       NaN       NaN       NaN NaN NaN
6        NaN       NaN       NaN       NaN NaN NaN
7        NaN       NaN       NaN       NaN NaN NaN
8        NaN       NaN       NaN       NaN NaN NaN
9        NaN       NaN       NaN       NaN NaN NaN
10       NaN       NaN       NaN       NaN NaN NaN
11       NaN       NaN       NaN       NaN NaN NaN

In [373]:
df - df1

          c1        c2        c3        c4  c5  c6
0   0.301681 -1.106422 -0.702093 -0.003994 NaN NaN
1  -2.218079  1.854270  1.500536 -2.358339 NaN NaN
2  -0.360112 -2.764740  1.040013  0.928775 NaN NaN
3  -2.509062  1.728695 -1.981406 -1.084383 NaN NaN
4  -3.661375 -0.771803 -1.269833 -2.280920 NaN NaN
5        NaN       NaN       NaN       NaN NaN NaN
6        NaN       NaN       NaN       NaN NaN NaN
7        NaN       NaN       NaN       NaN NaN NaN
8        NaN       NaN       NaN       NaN NaN NaN
9        NaN       NaN       NaN       NaN NaN NaN
10       NaN       NaN       NaN       NaN NaN NaN
11       NaN       NaN       NaN       NaN NaN NaN

In [374]:
df * 2 / 2 *4

          c1        c2        c3        c4        c5        c6
0  -1.149344 -0.274039 -6.601896  0.613848 -0.394876 -6.314802
1  -5.028206  2.787312  5.684299 -2.960489  0.090518 -0.811834
2   1.188201 -0.892283  1.283623  2.910548  2.190390 -0.609536
3  -2.127441  1.589942 -5.776067 -4.532116 -6.977259  6.008673
4 -10.009354  1.310422 -2.138850 -4.785835  0.250121 -0.825422

In [375]:
df - df1.iloc[4]

         c1        c2        c3        c4  c5  c6
0 -1.446373 -1.167919 -2.385595 -0.931000 NaN NaN
1 -2.416088 -0.402581  0.685954 -1.824584 NaN NaN
2 -0.861987 -1.322480 -0.414215 -0.356825 NaN NaN
3 -1.690897 -0.701923 -2.179137 -2.217491 NaN NaN
4 -3.661375 -0.771803 -1.269833 -2.280920 NaN NaN

In [376]:
df1**2

          c1        c2            c3        c4
0   0.346941  1.077262  8.994261e-01  0.024792
1   0.923574  1.339672  6.314008e-03  2.618624
2   0.431863  6.460084  5.171149e-01  0.040457
3   3.909328  1.772119  2.887876e-01  0.002366
4   1.343367  1.208700  5.404022e-01  1.176057
5   1.035003  0.025491  5.421760e-09  0.401930
6   0.266485  0.003995  2.757548e-01  2.455411
7   0.194587  0.080176  1.098928e+00  0.662266
8   3.186952  0.618101  6.432223e-01  0.637860
9   0.535810  5.806487  2.312109e-02  0.923103
10  0.005521  0.201458  3.246816e+00  0.012110
11  0.030846  0.024522  9.793639e-01  0.144606

####  Boolean operators also work in data Frames

In [386]:
df = pd.DataFrame({'A' : [134, 21, 234], 'B' : [343, 11, 22] }, dtype=bool)
df1 = pd.DataFrame({'A' : [1, 0, 3], 'B' : [2, 10,6] }, dtype=bool)

In [387]:
df | df1

      A     B
0  True  True
1  True  True
2  True  True

In [388]:
df & df1

       A     B
0   True  True
1  False  True
2   True  True

In [389]:
df == df1

       A     B
0   True  True
1  False  True
2   True  True

In [390]:
-df

       A      B
0  False  False
1  False  False
2  False  False

# 11.9 Transposing

In [391]:
data = [(3, 'a'), (2, 'b'), (1, 'c'), (0, 'd')]
df=pd.DataFrame.from_records(data, columns = ['col_1', 'col_2'])
df

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [392]:
df[:3].T     # T refers to transpose function in pandas

       0  1  2
col_1  3  2  1
col_2  a  b  c

In [393]:
df[1:3].T

       1  2
col_1  2  1
col_2  b  c

- ## Dates

In [7]:
dates = pd.date_range('19900101', periods=20)

In [8]:
dates

DatetimeIndex(['1990-01-01', '1990-01-02', '1990-01-03', '1990-01-04',
               '1990-01-05', '1990-01-06', '1990-01-07', '1990-01-08',
               '1990-01-09', '1990-01-10', '1990-01-11', '1990-01-12',
               '1990-01-13', '1990-01-14', '1990-01-15', '1990-01-16',
               '1990-01-17', '1990-01-18', '1990-01-19', '1990-01-20'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(20,3), index=dates, columns=list('ABC'))
df

                   A         B         C
1990-01-01 -1.192620 -1.329997 -0.442795
1990-01-02 -0.028319  1.192385 -1.282387
1990-01-03 -0.909862 -0.108350 -0.144846
1990-01-04  1.146639  0.878923  0.882968
1990-01-05 -0.161919  0.279909 -0.606266
1990-01-06  0.014446 -0.887736  0.541793
1990-01-07 -0.291717  0.925246  1.101989
1990-01-08  1.080651 -0.623922 -1.533930
1990-01-09 -0.341293  0.371491 -0.416130
1990-01-10  0.784172 -0.826852  2.218301
1990-01-11 -0.667566 -0.444608  1.436622
1990-01-12 -0.904257  0.301887  0.634121
1990-01-13  1.180377  0.958928 -1.503067
1990-01-14 -0.593488 -1.390207  0.217409
1990-01-15 -2.068452  1.316611  0.116259
1990-01-16 -1.121324  0.937096 -0.149713
1990-01-17 -1.314961 -0.111043 -0.366683
1990-01-18 -1.257064 -1.923028  0.377249
1990-01-19  0.741501  0.454427 -0.459642
1990-01-20 -0.886837  0.450903 -0.535598

- ### Similarly

In [12]:
df = pd.DataFrame(np.random.randn(20,7), index=dates, columns=list('ABCEXYZ'))
df

,A,B,C,E,X,Y,Z
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096

In [13]:
df1 = pd.DataFrame({'X' : "Name",
                    'Y' : pd.Timestamp('18900103'),
                    'Z' : pd.Series([5]*4, dtype = "int32")
                   })

df1

      X          Y  Z
0  Name 1890-01-03  5
1  Name 1890-01-03  5
2  Name 1890-01-03  5
3  Name 1890-01-03  5

In [418]:
df1.dtypes

X            object
Y    datetime64[ns]
Z             int32
dtype: object

# 12. Viewing Data

- We can view data / display data in different ways:
- See the top & bottom rows of the frame
- Selecting a single column
- Selecting via [], which slices the rows.
- For getting a cross section using a label.
- Selecting on a multi-axis by label.
- Showing label slicing, both endpoints are included.
- Reduction in the dimensions of the returned object.
- For getting a scalar value.
- For getting fast access to a scalar.
- Select via the position of the passed integers.
- By integer slices, acting similar to numpy/python.
- By lists of integer position locations, similar to the numpy/python style.
- For slicing rows explicitly.
- For slicing columns explicitly.
- For getting a value explicitly.
- For getting fast access to a scalar.
- Using a single column’s values to select data.
- Selecting values from a DataFrame where a boolean condition is met.
- Using the isin() method for filtering.

#### Note that if we dont write the number in parenthesis than it will automatically generate first 5 rows from a data frame

In [16]:
df.head(15)

,A,B,C,E,X,Y,Z
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712

####  It will access values from the last

In [17]:
df.tail(15)

,A,B,C,E,X,Y,Z
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096

In [18]:
df.index

DatetimeIndex(['1990-01-01', '1990-01-02', '1990-01-03', '1990-01-04',
               '1990-01-05', '1990-01-06', '1990-01-07', '1990-01-08',
               '1990-01-09', '1990-01-10', '1990-01-11', '1990-01-12',
               '1990-01-13', '1990-01-14', '1990-01-15', '1990-01-16',
               '1990-01-17', '1990-01-18', '1990-01-19', '1990-01-20'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.values

array([[ 0.69113343,  0.08047815, -0.4251749 , -1.51921662, -1.50429664,
        -0.49760532, -0.47643814],
       [ 0.10832987,  0.67541363,  2.5502574 ,  0.10339214, -0.15387208,
         0.43741895,  0.632337  ],
       [ 0.29715454,  3.26806384,  0.21102777, -0.99280291, -0.58128674,
         0.48940115, -0.08544624],
       [-0.9258413 ,  0.55321804,  0.97302292,  0.17002606, -0.44736787,
        -1.12869292,  0.46415332],
       [-1.95905936,  0.06426841, -0.01030249, -1.91150282, -1.37455309,
        -0.19329485,  0.52701575],
       [-0.36814442,  0.85178717,  1.47392126,  1.81447016, -0.15840429,
        -0.31119073,  0.55277496],
       [ 0.06882195,  0.51531392, -0.53263197, -0.81107798, -0.58610866,
         0.78344461, -1.06801021],
       [-0.02916363,  0.14919935,  1.09404846, -1.40597808, -0.69401544,
        -2.20062613, -0.30117038],
       [ 1.03105817, -2.70940347, -0.70499938,  0.77092852, -1.08383145,
         0.56885903, -0.48785654],
       [ 0.15741149,  1.2367071 , -1.15264414, -0.66988934,  0.03057528,
         0.60401493, -0.4493465 ],
       [ 0.16714825, -0.85744202, -1.6078473 ,  0.21481883,  0.56911943,
         2.4416056 , -0.36232483],
       [ 4.04704019, -0.19340072,  1.30138511,  0.47937053,  0.13390535,
        -1.22659845, -2.64204143],
       [-0.43788597,  0.36271497,  0.72804146, -0.26657911,  0.50057967,
        -0.41965901,  0.42923581],
       [-0.45505811, -0.1501037 , -1.04740912, -0.3082577 , -1.73413571,
         1.64105412, -0.51648328],
       [-2.2253804 , -0.26626952,  3.03871808, -0.80037116, -0.17286872,
         0.89411045, -0.81671177],
       [-1.30601497, -1.3582124 ,  0.88652439,  0.48700058,  1.02808085,
        -1.04763555,  1.40534369],
       [ 0.90816212, -0.34506625,  0.32903732, -0.14875067, -0.82764901,
        -0.02184175, -0.3934239 ],
       [-0.80929467,  0.27337948,  1.89383261, -0.30444166,  0.36362417,
        -1.17907969,  0.41839396],
       [-1.00739583, -1.31564093, -0.34090091,  0.79587339, -1.0607909 ,
        -0.83868638,  0.85701364],
       [ 1.44856278,  0.61520453, -0.12103911, -1.10517558, -0.82991805,
        -1.62744219,  0.08209551]])

In [20]:
df.columns

Index(['A', 'B', 'C', 'E', 'X', 'Y', 'Z'], dtype='object')

In [21]:
df.sort_values(by = 'B')

,A,B,C,E,X,Y,Z
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446

In [22]:
df.T

,1990-01-01,1990-01-02,1990-01-03,1990-01-04,1990-01-05,1990-01-06,1990-01-07,1990-01-08,1990-01-09,1990-01-10,1990-01-11,1990-01-12,1990-01-13,1990-01-14,1990-01-15,1990-01-16,1990-01-17,1990-01-18,1990-01-19,1990-01-20
A,0.691133,0.108330,0.297155,-0.925841,-1.959059,-0.368144,0.068822,-0.029164,1.031058,0.157411,0.167148,4.047040,-0.437886,-0.455058,-2.225380,-1.306015,0.908162,-0.809295,-1.007396,1.448563
B,0.080478,0.675414,3.268064,0.553218,0.064268,0.851787,0.515314,0.149199,-2.709403,1.236707,-0.857442,-0.193401,0.362715,-0.150104,-0.266270,-1.358212,-0.345066,0.273379,-1.315641,0.615205
C,-0.425175,2.550257,0.211028,0.973023,-0.010302,1.473921,-0.532632,1.094048,-0.704999,-1.152644,-1.607847,1.301385,0.728041,-1.047409,3.038718,0.886524,0.329037,1.893833,-0.340901,-0.121039
E,-1.519217,0.103392,-0.992803,0.170026,-1.911503,1.814470,-0.811078,-1.405978,0.770929,-0.669889,0.214819,0.479371,-0.266579,-0.308258,-0.800371,0.487001,-0.148751,-0.304442,0.795873,-1.105176
X,-1.504297,-0.153872,-0.581287,-0.447368,-1.374553,-0.158404,-0.586109,-0.694015,-1.083831,0.030575,0.569119,0.133905,0.500580,-1.734136,-0.172869,1.028081,-0.827649,0.363624,-1.060791,-0.829918
Y,-0.497605,0.437419,0.489401,-1.128693,-0.193295,-0.311191,0.783445,-2.200626,0.568859,0.604015,2.441606,-1.226598,-0.419659,1.641054,0.894110,-1.047636,-0.021842,-1.179080,-0.838686,-1.627442
Z,-0.476438,0.632337,-0.085446,0.464153,0.527016,0.552775,-1.068010,-0.301170,-0.487857,-0.449346,-0.362325,-2.642041,0.429236,-0.516483,-0.816712,1.405344,-0.393424,0.418394,0.857014,0.082096

In [23]:
df.sort_index(axis =1,ascending = True)

,A,B,C,E,X,Y,Z
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096

In [24]:
df.describe()

,A,B,C,E,X,Y,Z
count,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000
mean,-0.029921,0.072510,0.426843,-0.270408,-0.429161,-0.141622,-0.111544
std,1.348294,1.178249,1.241013,0.911452,0.738921,1.142602,0.862403
min,-2.225380,-2.709403,-1.607847,-1.911503,-1.734136,-2.200626,-2.642041
25%,-0.838431,-0.285969,-0.452039,-0.856509,-0.887636,-1.067900,-0.479293
50%,0.019829,0.114839,0.270033,-0.285510,-0.514327,-0.252243,-0.193308
75%,0.395649,0.568715,1.145883,0.280957,0.056408,0.577648,0.479869
max,4.047040,3.268064,3.038718,1.814470,1.028081,2.441606,1.405344

In [25]:
df['C']

1990-01-01   -0.425175
1990-01-02    2.550257
1990-01-03    0.211028
1990-01-04    0.973023
1990-01-05   -0.010302
1990-01-06    1.473921
1990-01-07   -0.532632
1990-01-08    1.094048
1990-01-09   -0.704999
1990-01-10   -1.152644
1990-01-11   -1.607847
1990-01-12    1.301385
1990-01-13    0.728041
1990-01-14   -1.047409
1990-01-15    3.038718
1990-01-16    0.886524
1990-01-17    0.329037
1990-01-18    1.893833
1990-01-19   -0.340901
1990-01-20   -0.121039
Freq: D, Name: C, dtype: float64

In [26]:
df[1:3]

,A,B,C,E,X,Y,Z
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446

In [27]:
df.loc[:,['C','E']]

                   C         E
1990-01-01 -0.425175 -1.519217
1990-01-02  2.550257  0.103392
1990-01-03  0.211028 -0.992803
1990-01-04  0.973023  0.170026
1990-01-05 -0.010302 -1.911503
1990-01-06  1.473921  1.814470
1990-01-07 -0.532632 -0.811078
1990-01-08  1.094048 -1.405978
1990-01-09 -0.704999  0.770929
1990-01-10 -1.152644 -0.669889
1990-01-11 -1.607847  0.214819
1990-01-12  1.301385  0.479371
1990-01-13  0.728041 -0.266579
1990-01-14 -1.047409 -0.308258
1990-01-15  3.038718 -0.800371
1990-01-16  0.886524  0.487001
1990-01-17  0.329037 -0.148751
1990-01-18  1.893833 -0.304442
1990-01-19 -0.340901  0.795873
1990-01-20 -0.121039 -1.105176

In [31]:
df1.loc['0':'5',['Y','Z']]

           Y  Z
0 1890-01-03  5
1 1890-01-03  5
2 1890-01-03  5
3 1890-01-03  5

In [445]:
df1.loc[2,['X','Z']]

X    Name
Z       5
Name: 2, dtype: object

In [448]:
df1.loc[1,'X']

'Name'

- ### For getting fast access to a scalar

In [449]:
df1.at[2,'Y']

Timestamp('1890-01-03 00:00:00')

- ### Select via the position of the passed integers

In [450]:
df1.iloc[3]

X                   Name
Y    1890-01-03 00:00:00
Z                      5
Name: 3, dtype: object

- ### By integer slices, acting similar to numpy/python

In [453]:
df1.iloc[1:2,0:3]

      X          Y  Z
1  Name 1890-01-03  5

- ### By lists of integer position locations, similar to the numpy/python style

In [32]:
df.iloc[[4,2,1],[0,2]]

                   A         C
1990-01-05 -1.959059 -0.010302
1990-01-03  0.297155  0.211028
1990-01-02  0.108330  2.550257

- ### For slicing rows explicitly

In [33]:
df.iloc[:,1:3]

                   B         C
1990-01-01  0.080478 -0.425175
1990-01-02  0.675414  2.550257
1990-01-03  3.268064  0.211028
1990-01-04  0.553218  0.973023
1990-01-05  0.064268 -0.010302
1990-01-06  0.851787  1.473921
1990-01-07  0.515314 -0.532632
1990-01-08  0.149199  1.094048
1990-01-09 -2.709403 -0.704999
1990-01-10  1.236707 -1.152644
1990-01-11 -0.857442 -1.607847
1990-01-12 -0.193401  1.301385
1990-01-13  0.362715  0.728041
1990-01-14 -0.150104 -1.047409
1990-01-15 -0.266270  3.038718
1990-01-16 -1.358212  0.886524
1990-01-17 -0.345066  0.329037
1990-01-18  0.273379  1.893833
1990-01-19 -1.315641 -0.340901
1990-01-20  0.615205 -0.121039

- ### For getting a value explicitly

In [34]:
df.iloc[1,2]

2.550257404764401

- ### Using a single column’s values to select data.

In [36]:
df[df.B > 0]

,A,B,C,E,X,Y,Z
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096

- ### Selecting values from a DataFrame where a boolean condition is met.

In [40]:
df1[df > 0]

     X   Y   Z
0  NaN NaT NaN
1  NaN NaT NaN
2  NaN NaT NaN
3  NaN NaT NaN

In [43]:
df1['E'] = ['one', 'one','two','three']
df1

      X          Y  Z      E
0  Name 1890-01-03  5    one
1  Name 1890-01-03  5    one
2  Name 1890-01-03  5    two
3  Name 1890-01-03  5  three

- ### Using the isin() method for filtering:

In [45]:
df1[df1['E'].isin(['two','four'])]

      X          Y  Z    E
2  Name 1890-01-03  5  two

- ### Using the isin() method for filtering:

In [464]:
df2[df2['E'].isin(['two','four','six','one'])]

         c1        c2        c3        c4     E
0  1.958815  0.176657  1.180861 -0.435416   one
1  0.744520  0.519084 -0.309884  1.094044   one
2 -1.393381  0.662124 -0.805079 -1.043275   two
4  0.866108  0.343891  1.430990 -1.347236  four

In [47]:
df['new'] = [2,5,7,4,10,6,7,8,9,9,6,7,8,9,9,6,7,8,9,9]
df

,A,B,C,E,X,Y,Z,new
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438,2
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337,5
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446,7
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153,4
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016,10
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775,6
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010,7
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170,8
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857,9
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346,9
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325,6
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041,7
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236,8
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483,9
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712,9
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344,6
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424,7
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394,8
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014,9
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096,9

In [48]:
df[df<0]

,A,B,C,E,X,Y,Z,new
1990-01-01,NaN,NaN,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438,NaN
1990-01-02,NaN,NaN,NaN,NaN,-0.153872,NaN,NaN,NaN
1990-01-03,NaN,NaN,NaN,-0.992803,-0.581287,NaN,-0.085446,NaN
1990-01-04,-0.925841,NaN,NaN,NaN,-0.447368,-1.128693,NaN,NaN
1990-01-05,-1.959059,NaN,-0.010302,-1.911503,-1.374553,-0.193295,NaN,NaN
1990-01-06,-0.368144,NaN,NaN,NaN,-0.158404,-0.311191,NaN,NaN
1990-01-07,NaN,NaN,-0.532632,-0.811078,-0.586109,NaN,-1.068010,NaN
1990-01-08,-0.029164,NaN,NaN,-1.405978,-0.694015,-2.200626,-0.301170,NaN
1990-01-09,NaN,-2.709403,-0.704999,NaN,-1.083831,NaN,-0.487857,NaN
1990-01-10,NaN,NaN,-1.152644,-0.669889,NaN,NaN,-0.449346,NaN
1990-01-11,NaN,-0.857442,-1.607847,NaN,NaN,NaN,-0.362325,NaN
1990-01-12,NaN,-0.193401,NaN,NaN,NaN,-1.226598,-2.642041,NaN
1990-01-13,-0.437886,NaN,NaN,-0.266579,NaN,-0.419659,NaN,NaN
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,NaN,-0.516483,NaN
1990-01-15,-2.225380,-0.266270,NaN,-0.800371,-0.172869,NaN,-0.816712,NaN
1990-01-16,-1.306015,-1.358212,NaN,NaN,NaN,-1.047636,NaN,NaN
1990-01-17,NaN,-0.345066,NaN,-0.148751,-0.827649,-0.021842,-0.393424,NaN
1990-01-18,-0.809295,NaN,NaN,-0.304442,NaN,-1.179080,NaN,NaN
1990-01-19,-1.007396,-1.315641,-0.340901,NaN,-1.060791,-0.838686,NaN,NaN
1990-01-20,NaN,NaN,-0.121039,-1.105176,-0.829918,-1.627442,NaN,NaN

In [49]:
df[df==0]

             A   B   C   E   X   Y   Z  new
1990-01-01 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-02 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-03 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-04 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-05 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-06 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-07 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-08 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-09 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-10 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-11 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-12 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-13 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-14 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-15 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-16 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-17 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-18 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-19 NaN NaN NaN NaN NaN NaN NaN  NaN
1990-01-20 NaN NaN NaN NaN NaN NaN NaN  NaN

In [50]:
df[df!=0]

,A,B,C,E,X,Y,Z,new
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438,2
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337,5
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446,7
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153,4
1990-01-05,-1.959059,0.064268,-0.010302,-1.911503,-1.374553,-0.193295,0.527016,10
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775,6
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010,7
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170,8
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857,9
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346,9
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325,6
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041,7
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236,8
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483,9
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712,9
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344,6
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424,7
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394,8
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014,9
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096,9

In [52]:
df[df.new < 10]

,A,B,C,E,X,Y,Z,new
1990-01-01,0.691133,0.080478,-0.425175,-1.519217,-1.504297,-0.497605,-0.476438,2
1990-01-02,0.108330,0.675414,2.550257,0.103392,-0.153872,0.437419,0.632337,5
1990-01-03,0.297155,3.268064,0.211028,-0.992803,-0.581287,0.489401,-0.085446,7
1990-01-04,-0.925841,0.553218,0.973023,0.170026,-0.447368,-1.128693,0.464153,4
1990-01-06,-0.368144,0.851787,1.473921,1.814470,-0.158404,-0.311191,0.552775,6
1990-01-07,0.068822,0.515314,-0.532632,-0.811078,-0.586109,0.783445,-1.068010,7
1990-01-08,-0.029164,0.149199,1.094048,-1.405978,-0.694015,-2.200626,-0.301170,8
1990-01-09,1.031058,-2.709403,-0.704999,0.770929,-1.083831,0.568859,-0.487857,9
1990-01-10,0.157411,1.236707,-1.152644,-0.669889,0.030575,0.604015,-0.449346,9
1990-01-11,0.167148,-0.857442,-1.607847,0.214819,0.569119,2.441606,-0.362325,6
1990-01-12,4.047040,-0.193401,1.301385,0.479371,0.133905,-1.226598,-2.642041,7
1990-01-13,-0.437886,0.362715,0.728041,-0.266579,0.500580,-0.419659,0.429236,8
1990-01-14,-0.455058,-0.150104,-1.047409,-0.308258,-1.734136,1.641054,-0.516483,9
1990-01-15,-2.225380,-0.266270,3.038718,-0.800371,-0.172869,0.894110,-0.816712,9
1990-01-16,-1.306015,-1.358212,0.886524,0.487001,1.028081,-1.047636,1.405344,6
1990-01-17,0.908162,-0.345066,0.329037,-0.148751,-0.827649,-0.021842,-0.393424,7
1990-01-18,-0.809295,0.273379,1.893833,-0.304442,0.363624,-1.179080,0.418394,8
1990-01-19,-1.007396,-1.315641,-0.340901,0.795873,-1.060791,-0.838686,0.857014,9
1990-01-20,1.448563,0.615205,-0.121039,-1.105176,-0.829918,-1.627442,0.082096,9